{
        "id": 1,
        "emoji": "✏️",
        "slug": "orbit-notes",
        "title": "How/why I created Orbit - Productivity tracker/Notes app",
        "date": "17th October 2025",
        "description": "A few paragrahs highlighting how/why I created Orbit Notes, and what I learnt from it as a developer.",
        "paragraph1": "Orbit Notes is a notes and productivity board application that lets you switch between both Kanban and masonry layouts. It can be used as either a notes app or a task tracking app.",
        "paragraph2": "The idea for this app came from my own need for a productivity tool. I wanted a way to quickly track tasks and notes for my personal projects in one place. After doing some research, I realised that popular apps like Trello and Google Keep each specialised in different areas — Trello is great for task tracking but not ideal for taking notes, while Keep is great for notes but lacks proper task management.",
        "paragraph3": "So, being a web developer, I decided to create my own solution. Using React and TypeScript (along with dnd-kit for drag and drop), I got to work. The project took me about two months to fully flesh out the main idea: combining the best features from both Trello and Keep into one standalone app.",
        "paragraph4": "Orbit Notes now supports multiple boards via React Router, includes search filters for both boards and individual notes/tasks, and lets users switch between different board layouts. It’s hosted live on Vercel, and I’ve even gained a few recurring users. ",
        "paragraph5": "As a junior developer, I built this project as a way to strengthen my skills in React and TypeScript while also experimenting with new libraries and patterns. It might not be as complex or feature-rich as I first envisioned, but I’ve learned a great deal from it and I’m really proud of how it’s turned out so far.",
        "paragraph6": "This isn’t the end for Orbit Notes, though. I plan to continue updating it over time, adding new features such as a left sidebar to view all boards, syncing notes across devices instead of relying solely on localStorage (through user accounts), and more."
}